set_input_delay 0.2 [get_ports {a b}]
set_load 10 [get_ports {result overflow}]
set_output_delay 0.5 [get_ports {result overflow}]
