create_clock -name clk -period 5 [get_ports clk]
set_input_delay -max 0.2 -clock [get_clocks clk] [remove_from_collection [all_inputs ] [get_ports clk]]
set_output_delay -max 0.5 -clock [get_clocks clk] [all_outputs]
set_load 10 [get_ports a]
set_load 10 [get_ports b]
set_load 10 [get_ports rst]
set_output_delay 0.5 -max [get_ports result]
set_output_delay 0.5 -max [get_ports overflow]